OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/can.c
/**************************************************************************//**
* @file     can.c
* @version  V1.00
* $Revision: 1 $
* $Date: 15/06/11 2:44p $
* @brief    NUC970 CAN driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "nuc970.h"
#include "sys.h"
#include "can.h"

/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_CAN_Driver CAN Driver
  @{
*/

/** @addtogroup NUC970_CAN_EXPORTED_CONSTANTS CAN Exported Constants
  @{
*/

/*@}*/ /* end of group NUC970_CAN_EXPORTED_CONSTANTS */

#include <stdio.h>


/// @cond HIDDEN_SYMBOLS


//#define DEBUG_PRINTF sysprintf
#define DEBUG_PRINTF(...)

/**
  * @brief    Enter initialization mode
  * @param[in]    uCAN    CAN channel.
  * @return   None
  * @details  This function is used to set CAN to enter initialization mode and enable access bit timing
  *           register. After bit timing configuration ready, user must call CAN_LeaveInitMode()
  *           to leave initialization mode and lock bit timing register to let new configuration
  *           take effect.
  */
void CAN_EnterInitMode(UINT32 uCAN)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	UINT32 uRegAddress;

	uRegAddress = REG_CAN0_CON + uOffset;
	outpw(uRegAddress, inpw(uRegAddress)|CAN_CON_INIT_Msk);
	outpw(uRegAddress, inpw(uRegAddress)|CAN_CON_CCE_Msk);
}


/**
  * @brief    Leave initialization mode
  * @param[in]    uCAN    CAN channel.
  * @return   None
  * @details  This function is used to set CAN to leave initialization mode to let
  *           bit timing configuration take effect after configuration ready.
  */
void CAN_LeaveInitMode(UINT32 uCAN)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	UINT32 uRegAddress, uRegVal;

	uRegAddress = REG_CAN0_CON + uOffset;
	uRegVal = inpw(uRegAddress);
	uRegVal &= (~(CAN_CON_INIT_Msk | CAN_CON_CCE_Msk));
	outpw(uRegAddress, uRegVal);
	
	while(inpw(uRegAddress) & CAN_CON_INIT_Msk);
}

/**
  * @brief    Wait message into message buffer in basic mode.
  * @param[in]    uCAN    CAN channel.
  * @return   None
  * @details  This function is used to wait message into message buffer in basic mode. Please notice the
  *           function is polling NEWDAT bit of MCON register by while loop and it is used in basic mode.
  */
void CAN_WaitMsg(UINT32 uCAN)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;

	outpw((REG_CAN0_STATUS+uOffset), 0x0);
	
	while(1)
	{
		if(inpw(REG_CAN0_IF2_MCON+uOffset) & CAN_IF_MCON_NEWDAT_Msk)
		{
			DEBUG_PRINTF("New Data IN\n");
            break;
		}
		
		if(inpw(REG_CAN0_STATUS+uOffset) & CAN_STATUS_RXOK_Msk)
			DEBUG_PRINTF("Rx OK\n");
		
		if(inpw(REG_CAN0_STATUS+uOffset) & CAN_STATUS_LEC_Msk)
			DEBUG_PRINTF("Error\n");		
	}

}

/**
  * @brief    Get current bit rate
  * @param[in]    uCAN    CAN channel.
  * @return   Current Bit-Rate (kilo bit per second)
  * @details  Return current CAN bit rate according to the user bit-timing parameter settings
  */
uint32_t CAN_GetCANBitRate(UINT32  uCAN)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	UINT32 uRegAddress;
	
    UINT8 u8Tseg1,u8Tseg2;
    UINT32 u32Bpr, u32Value;

	u32Value = sysGetClock(SYS_PCLK)*1000000;
	
	uRegAddress = REG_CAN0_BTIME + uOffset;
	u8Tseg1 = (inpw(uRegAddress) & CAN_BTIME_TSEG1_Msk) >> CAN_BTIME_TSEG1_Pos;
	u8Tseg2 = (inpw(uRegAddress) & CAN_BTIME_TSEG2_Msk) >> CAN_BTIME_TSEG2_Pos;
	u32Bpr  = (inpw(uRegAddress) & CAN_BTIME_BRP_Msk) | (inpw(REG_CAN0_BRPE+uOffset) << 6);
	
    return (u32Value/(u32Bpr+1)/(u8Tseg1 + u8Tseg2 + 3));
}

/**
  * @brief    Switch the CAN into test mode.
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u8TestMask  Specifies the configuration in test modes
  *                             CAN_TEST_BASIC_Msk   : Enable basic mode of test mode
  *                             CAN_TESTR_SILENT_Msk  : Enable silent mode of test mode
  *                             CAN_TESTR_LBACK_Msk   : Enable Loop Back Mode of test mode
  *                             CAN_TESTR_TX0_Msk/CAN_TESTR_TX1_Msk: Control CAN_TX pin bit field
  * @return   None
  * @details  Switch the CAN into test mode. There are four test mode (BASIC/SILENT/LOOPBACK/
  *           LOOPBACK combined SILENT/CONTROL_TX_PIN)could be selected. After setting test mode,user
  *           must call CAN_LeaveInitMode() to let the setting take effect.
  */
void CAN_EnterTestMode(UINT32 uCAN, uint8_t u8TestMask)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	UINT32 uRegVal;

	uRegVal = inpw(REG_CAN0_CON+uOffset);
	uRegVal |= CAN_CON_TEST_Msk;
	outpw((REG_CAN0_CON+uOffset), uRegVal);
	
	outpw((REG_CAN0_TEST+uOffset), u8TestMask);
}




/**
  * @brief    Leave the test mode
  * @param[in]    uCAN    CAN channel.
  * @return   None
  * @details  This function is used to Leave the test mode (switch into normal mode).
  */
void CAN_LeaveTestMode(UINT32 uCAN)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	UINT32 uRegVal;
	
	uRegVal = inpw(REG_CAN0_CON+uOffset);
	uRegVal |= CAN_CON_TEST_Msk;
	outpw((REG_CAN0_CON+uOffset), uRegVal);
	
	uRegVal = inpw(REG_CAN0_TEST+uOffset);
	uRegVal &= ~CAN_CON_TEST_Msk;
	outpw((REG_CAN0_TEST+uOffset), uRegVal);
	
	uRegVal = inpw(REG_CAN0_CON+uOffset);
	uRegVal &= ~CAN_CON_TEST_Msk;
	outpw((REG_CAN0_CON+uOffset), uRegVal);
}

/**
  * @brief    Get the waiting status of a received message.
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u8MsgObj    Specifies the Message object number, from 0 to 31.
  * @retval   non-zero    The corresponding message object has a new data bit is set.
  * @retval   0           No message object has new data.
  * @details  This function is used to get the waiting status of a received message.
  */
uint32_t CAN_IsNewDataReceived(UINT32 uCAN, uint8_t u8MsgObj)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
	return (u8MsgObj < 16 ? inpw(REG_CAN0_NDAT1 + uOffset) & (1 << u8MsgObj) : inpw(REG_CAN0_NDAT2 + uOffset) & (1 << (u8MsgObj-16)));
}


/**
  * @brief    Send CAN message in BASIC mode of test mode
  * @param[in]    uCAN    CAN channel.
  * @param[in]    pCanMsg     Pointer to the message structure containing data to transmit.
  * @return   TRUE:  Transmission OK
  *           FALSE: Check busy flag of interface 0 is timeout
  * @details  The function is used to send CAN message in BASIC mode of test mode. Before call the API,
  *           the user should be call CAN_EnterTestMode(CAN_TESTR_BASIC) and let CAN controller enter
  *           basic mode of test mode. Please notice IF1 Registers used as Tx Buffer in basic mode.
  */
int32_t CAN_BasicSendMsg(UINT32 uCAN, STR_CANMSG_T* pCanMsg)
{
	
	UINT32 uOffset = uCAN * CAN_OFFSET;
	UINT32 uRegVal;
	
    UINT32 i=0;
	
	while(inpw(REG_CAN0_IF1_CREQ+uOffset) & CAN_IF_CREQ_BUSY_Msk);
	
	uRegVal = inpw(REG_CAN0_STATUS+uOffset);
	uRegVal &= ~CAN_STATUS_TXOK_Msk;
	outpw((REG_CAN0_STATUS+uOffset), uRegVal);

