OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/can.c
	outpw((REG_CAN0_IF1_CMASK+uOffset), CAN_IF_CMASK_WRRD_Msk);

    if (pCanMsg->IdType == CAN_STD_ID) {
        /* standard ID*/
		outpw((REG_CAN0_IF1_ARB1+uOffset), 0x0);
		outpw((REG_CAN0_IF1_ARB2+uOffset), (((pCanMsg->Id)&0x7FF)<<2));
    } else {
        /* extended ID*/
		outpw((REG_CAN0_IF1_ARB1+uOffset), ((pCanMsg->Id)&0xFFFF));
		outpw((REG_CAN0_IF1_ARB2+uOffset), (((pCanMsg->Id)&0x1FFF0000)>>16  | CAN_IF_ARB2_XTD_Msk) );
    }

    if(pCanMsg->FrameType)
	{
		uRegVal = inpw(REG_CAN0_IF1_ARB2+uOffset);
		uRegVal |= CAN_IF_ARB2_DIR_Msk;
		outpw((REG_CAN0_IF1_ARB2+uOffset), uRegVal);
	}
    else
	{ 
		uRegVal = inpw(REG_CAN0_IF1_ARB2+uOffset);
		uRegVal &= ~CAN_IF_ARB2_DIR_Msk;
		outpw((REG_CAN0_IF1_ARB2+uOffset), uRegVal);
	}
	
	outpw((REG_CAN0_IF1_MCON+uOffset), (inpw(REG_CAN0_IF1_MCON+uOffset) & (~CAN_IF_MCON_DLC_Msk) | pCanMsg->DLC) );
	outpw((REG_CAN0_IF1_DAT_A1+uOffset), (((uint16_t)pCanMsg->Data[1]<<8) | pCanMsg->Data[0]));
	outpw((REG_CAN0_IF1_DAT_A2+uOffset), (((uint16_t)pCanMsg->Data[3]<<8) | pCanMsg->Data[2]));
	outpw((REG_CAN0_IF1_DAT_B1+uOffset), (((uint16_t)pCanMsg->Data[5]<<8) | pCanMsg->Data[4])); 
	outpw((REG_CAN0_IF1_DAT_B2+uOffset), (((uint16_t)pCanMsg->Data[7]<<8) | pCanMsg->Data[6]));

    /* request transmission*/
	outpw((REG_CAN0_IF1_CREQ+uOffset), (inpw(REG_CAN0_IF1_CREQ+uOffset) & (~CAN_IF_CREQ_BUSY_Msk)));
	
	if(inpw(REG_CAN0_IF1_CREQ+uOffset) & CAN_IF_CREQ_BUSY_Msk){
        DEBUG_PRINTF("Cannot clear busy for sending ...\n");
        return FALSE;
    }
                      
	outpw((REG_CAN0_IF1_CREQ+uOffset), (inpw(REG_CAN0_IF1_CREQ+uOffset) | CAN_IF_CREQ_BUSY_Msk));  // sending

    for ( i=0; i<0xFFFFF; i++) {
		if( (inpw(REG_CAN0_IF1_CREQ+uOffset) & CAN_IF_CREQ_BUSY_Msk) == 0 ) break;
    }

    if ( i >= 0xFFFFF ) {
        DEBUG_PRINTF("Cannot send out...\n");
        return FALSE;
    }

    return TRUE;
}


/**
  * @brief    Get a message information in BASIC mode.
  *
  * @param[in]    uCAN    CAN channel.
  * @param[out]    pCanMsg     Pointer to the message structure where received data is copied.
  *
  * @return   FALSE  No any message received. \n
  *           TRUE   Receive a message success.
  *
  */
int32_t CAN_BasicReceiveMsg(UINT32 uCAN, STR_CANMSG_T* pCanMsg)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
	if((inpw(REG_CAN0_IF2_MCON+uOffset) & CAN_IF_MCON_NEWDAT_Msk) == 0){ /* In basic mode, receive data always save in IF2 */
        return FALSE;
    }

	outpw((REG_CAN0_STATUS+uOffset), (inpw(REG_CAN0_STATUS+uOffset) & (~CAN_STATUS_RXOK_Msk)));

	outpw((REG_CAN0_IF2_CMASK+uOffset), ( CAN_IF_CMASK_ARB_Msk
                                        | CAN_IF_CMASK_CONTROL_Msk
                                        | CAN_IF_CMASK_DATAA_Msk
                                        | CAN_IF_CMASK_DATAB_Msk));
	

	if((inpw(REG_CAN0_IF2_ARB2+uOffset) & CAN_IF_ARB2_XTD_Msk) == 0) {
        /* standard ID*/
        pCanMsg->IdType = CAN_STD_ID;
		pCanMsg->Id = (inpw(REG_CAN0_IF2_ARB2+uOffset) >> 2) & 0x07ff;

    } else {
        /* extended ID*/
        pCanMsg->IdType = CAN_EXT_ID;
		pCanMsg->Id  = (inpw(REG_CAN0_IF2_ARB2+uOffset) &0x1FFF) << 16;
		pCanMsg->Id |= inpw(REG_CAN0_IF2_ARB1+uOffset);
    }

	pCanMsg->FrameType = !((inpw(REG_CAN0_IF2_ARB2+uOffset) & CAN_IF_ARB2_DIR_Msk) >> CAN_IF_ARB2_DIR_Pos);

	pCanMsg->DLC     = inpw(REG_CAN0_IF2_MCON+uOffset) & CAN_IF_MCON_DLC_Msk;
	pCanMsg->Data[0] = inpw(REG_CAN0_IF2_DAT_A1+uOffset) & CAN_IF_DAT_A1_DATA0_Msk;
	pCanMsg->Data[1] = (inpw(REG_CAN0_IF2_DAT_A1+uOffset) & CAN_IF_DAT_A1_DATA1_Msk) >> CAN_IF_DAT_A1_DATA1_Pos;
	pCanMsg->Data[2] = inpw(REG_CAN0_IF2_DAT_A2+uOffset) & CAN_IF_DAT_A2_DATA2_Msk;
	pCanMsg->Data[3] = (inpw(REG_CAN0_IF2_DAT_A2+uOffset) & CAN_IF_DAT_A2_DATA3_Msk) >> CAN_IF_DAT_A2_DATA3_Pos;
	pCanMsg->Data[4] = inpw(REG_CAN0_IF2_DAT_B1+uOffset) & CAN_IF_DAT_B1_DATA4_Msk;
	pCanMsg->Data[5] = (inpw(REG_CAN0_IF2_DAT_B1+uOffset) & CAN_IF_DAT_B1_DATA5_Msk) >> CAN_IF_DAT_B1_DATA5_Pos;
	pCanMsg->Data[6] = inpw(REG_CAN0_IF2_DAT_B2+uOffset) & CAN_IF_DAT_B2_DATA6_Msk;
	pCanMsg->Data[7] = (inpw(REG_CAN0_IF2_DAT_B2+uOffset) & CAN_IF_DAT_B2_DATA7_Msk) >> CAN_IF_DAT_B2_DATA7_Pos;

    return TRUE;
}

/**
  * @brief    Set Rx message object
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u8MsgObj    Specifies the Message object number, from 0 to 31.
  * @param[in]    u8idType    Specifies the identifier type of the frames that will be transmitted
  *                       This parameter can be one of the following values:
  *                       CAN_STD_ID (standard ID, 11-bit)
  *                       CAN_EXT_ID (extended ID, 29-bit)
  * @param[in]    u32id       Specifies the identifier used for acceptance filtering.
  * @param[in]    u8singleOrFifoLast  Specifies the end-of-buffer indicator.
  *                                 This parameter can be one of the following values:
  *                                 TRUE: for a single receive object or a FIFO receive object that is the last one of the FIFO.
  *                                 FALSE: for a FIFO receive object that is not the last one.
  * @retval   TRUE           SUCCESS
  * @retval   FALSE   No useful interface
  * @details  The function is used to configure a receive message object.
  */
int32_t CAN_SetRxMsgObj(UINT32  uCAN, uint8_t u8MsgObj, uint8_t u8idType, uint32_t u32id, uint8_t u8singleOrFifoLast)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
	if((inpw(REG_CAN0_IF2_CREQ+uOffset) & CAN_IF_CREQ_BUSY_Msk) != 0)
	{
        return FALSE;
	}
	
    /* Command Setting */
	outpw((REG_CAN0_IF2_CMASK+uOffset), (CAN_IF_CMASK_WRRD_Msk | CAN_IF_CMASK_MASK_Msk | CAN_IF_CMASK_ARB_Msk |
                                         CAN_IF_CMASK_CONTROL_Msk | CAN_IF_CMASK_DATAA_Msk | CAN_IF_CMASK_DATAB_Msk));

    if (u8idType == CAN_STD_ID) { /* According STD/EXT ID format,Configure Mask and Arbitration register */
		outpw((REG_CAN0_IF2_ARB1+uOffset), 0x0);
		outpw((REG_CAN0_IF2_ARB2+uOffset), (CAN_IF_ARB2_MSGVAL_Msk | (u32id & 0x7FF)<< 2));
    } else {
		outpw((REG_CAN0_IF2_ARB1+uOffset), (u32id & 0xFFFF));
		outpw((REG_CAN0_IF2_ARB2+uOffset), (CAN_IF_ARB2_MSGVAL_Msk | CAN_IF_ARB2_XTD_Msk | (u32id & 0x1FFF0000)>>16));
    }

	outpw((REG_CAN0_IF2_MCON+uOffset), (inpw(REG_CAN0_IF2_MCON+uOffset) | CAN_IF_MCON_UMASK_Msk | CAN_IF_MCON_RXIE_Msk));
	
    if(u8singleOrFifoLast)
	{
		outpw((REG_CAN0_IF2_MCON+uOffset), (inpw(REG_CAN0_IF2_MCON+uOffset) | CAN_IF_MCON_EOB_Msk));
	}
    else
	{
		outpw((REG_CAN0_IF2_MCON+uOffset), (inpw(REG_CAN0_IF2_MCON+uOffset) & ~CAN_IF_MCON_EOB_Msk));
	}
	
	outpw((REG_CAN0_IF2_DAT_A1+uOffset), 0x0);
	outpw((REG_CAN0_IF2_DAT_A2+uOffset), 0x0);
	outpw((REG_CAN0_IF2_DAT_B1+uOffset), 0x0);
	outpw((REG_CAN0_IF2_DAT_B2+uOffset), 0x0);
	
