OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/can.c
	outpw((REG_CAN0_IF2_CREQ+uOffset), (1 + u8MsgObj));
	
    return TRUE;
}


/**
  * @brief    Gets the message
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u8MsgObj    Specifies the Message object number, from 0 to 31.
  * @param[in]    u8Release   Specifies the message release indicator.
  *                       This parameter can be one of the following values:
  *                        TRUE: the message object is released when getting the data.
  *                        FALSE:the message object is not released.
  * @param[out]    pCanMsg     Pointer to the message structure where received data is copied.
  * @retval   TRUE   Success
  * @retval   FALSE    No any message received
  * @details  Gets the message, if received.
  */
int32_t CAN_ReadMsgObj(UINT32 uCAN, uint8_t u8MsgObj, uint8_t u8Release, STR_CANMSG_T* pCanMsg)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;

	if (!CAN_IsNewDataReceived(uCAN, u8MsgObj)) {
        return FALSE;
    }

	outpw((REG_CAN0_STATUS+uOffset), (inpw(REG_CAN0_STATUS+uOffset) & ~CAN_STATUS_RXOK_Msk));

    /* read the message contents*/
	outpw((REG_CAN0_IF2_CMASK+uOffset), (CAN_IF_CMASK_MASK_Msk
                                       | CAN_IF_CMASK_ARB_Msk
                                       | CAN_IF_CMASK_CONTROL_Msk
                                       | CAN_IF_CMASK_CLRINTPND_Msk
                                       | (u8Release ? CAN_IF_CMASK_TXRQSTNEWDAT_Msk : 0)
                                       | CAN_IF_CMASK_DATAA_Msk
                                       | CAN_IF_CMASK_DATAB_Msk));

	outpw((REG_CAN0_IF2_CREQ+uOffset), (1 + u8MsgObj));

	while (inpw(REG_CAN0_IF2_CREQ+uOffset) & CAN_IF_CREQ_BUSY_Msk) {
        /*Wait*/
    }

	if ((inpw(REG_CAN0_IF2_ARB2+uOffset) & CAN_IF_ARB2_XTD_Msk) == 0) {
        /* standard ID*/
        pCanMsg->IdType = CAN_STD_ID;
		pCanMsg->Id     = (inpw(REG_CAN0_IF2_ARB2+uOffset) & CAN_IF_ARB2_ID_Msk) >> 2;
    } else {
        /* extended ID*/
        pCanMsg->IdType = CAN_EXT_ID;
		pCanMsg->Id  = (((inpw(REG_CAN0_IF2_ARB2+uOffset)) & 0x1FFF)<<16) | inpw(REG_CAN0_IF2_ARB1+uOffset);
    }

	pCanMsg->DLC     = inpw(REG_CAN0_IF2_MCON+uOffset) & CAN_IF_MCON_DLC_Msk;
    pCanMsg->Data[0] = inpw(REG_CAN0_IF2_DAT_A1+uOffset) & CAN_IF_DAT_A1_DATA0_Msk;
    pCanMsg->Data[1] = (inpw(REG_CAN0_IF2_DAT_A1+uOffset) & CAN_IF_DAT_A1_DATA1_Msk) >> CAN_IF_DAT_A1_DATA1_Pos;
    pCanMsg->Data[2] = inpw(REG_CAN0_IF2_DAT_A2+uOffset) & CAN_IF_DAT_A2_DATA2_Msk;
    pCanMsg->Data[3] = (inpw(REG_CAN0_IF2_DAT_A2+uOffset) & CAN_IF_DAT_A2_DATA3_Msk) >> CAN_IF_DAT_A2_DATA3_Pos;
    pCanMsg->Data[4] = inpw(REG_CAN0_IF2_DAT_B1+uOffset) & CAN_IF_DAT_B1_DATA4_Msk;
    pCanMsg->Data[5] = (inpw(REG_CAN0_IF2_DAT_B1+uOffset) & CAN_IF_DAT_B1_DATA5_Msk) >> CAN_IF_DAT_B1_DATA5_Pos;
    pCanMsg->Data[6] = inpw(REG_CAN0_IF2_DAT_B2+uOffset) & CAN_IF_DAT_B2_DATA6_Msk;
    pCanMsg->Data[7] = (inpw(REG_CAN0_IF2_DAT_B2+uOffset) & CAN_IF_DAT_B2_DATA7_Msk) >> CAN_IF_DAT_B2_DATA7_Pos;

    return TRUE;
}

/// @endcond HIDDEN_SYMBOLS

/** @addtogroup NUC970_CAN_EXPORTED_FUNCTIONS CAN Exported Functions
  @{
*/


/**
  * @brief    The function is used to set bus timing parameter according current clock and target baud-rate.
  *
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32BaudRate The target CAN baud-rate. The range of u32BaudRate is 1~1000KHz
  *
  * @return   u32CurrentBitRate  Real baud-rate value
  */
uint32_t CAN_SetBaudRate(UINT32 uCAN, uint32_t u32BaudRate)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
    uint8_t u8Tseg1,u8Tseg2;
    uint32_t u32Brp;
    uint32_t u32Value;

	CAN_EnterInitMode(uCAN);

	u32Value = sysGetClock(SYS_PCLK);
	u32Value = u32Value*1000000;

	//sysprintf("\n PCLK = %d \n", u32Value);
	
    if(u32BaudRate * 8 < (u32Value/2)) {
        u8Tseg1 = 2;
        u8Tseg2 = 3;
    } else {
        u8Tseg1 = 2;
        u8Tseg2 = 1;
    }

    u32Brp  = u32Value/(u32BaudRate) / (u8Tseg1 + u8Tseg2 + 3) -1;

	u32Value = ((uint32_t)u8Tseg2 << CAN_BTIME_TSEG2_Pos) | ((uint32_t)u8Tseg1 << CAN_BTIME_TSEG1_Pos) |
               (u32Brp & CAN_BTIME_BRP_Msk) | (inpw(REG_CAN0_BTIME+uOffset) & CAN_BTIME_SJW_Msk);
	
	outpw((REG_CAN0_BTIME+uOffset), u32Value);
	outpw((REG_CAN0_BRPE+uOffset), ((u32Brp >> 6) & 0x0F));

	CAN_LeaveInitMode(uCAN);

	return (CAN_GetCANBitRate(uCAN));

}

/**
  * @brief    The function is used to disable all CAN interrupt.
  *
  * @param[in]     uCAN    CAN channel.
  *
  * @return   None
  */
void CAN_Close(UINT32 uCAN)
{
	CAN_DisableInt(uCAN, (CAN_CON_IE_Msk|CAN_CON_SIE_Msk|CAN_CON_EIE_Msk));
}

/**
  * @brief    The function is sets bus timing parameter according current clock and target baud-rate. And set CAN operation mode.
  *
  * @param[in]     uCAN    CAN channel.
  * @param[in]    u32BaudRate The target CAN baud-rate. The range of u32BaudRate is 1~1000KHz
  * @param[in]    u32Mode     The CAN operation mode. ( \ref CAN_NORMAL_MODE / \ref CAN_BASIC_MODE)
  *
  * @return   u32CurrentBitRate  Real baud-rate value
  */
uint32_t CAN_Open(UINT32 uCAN, uint32_t u32BaudRate, uint32_t u32Mode)
{
    uint32_t u32CurrentBitRate;

	u32CurrentBitRate = CAN_SetBaudRate(uCAN, u32BaudRate);

    if(u32Mode == CAN_BASIC_MODE)
		CAN_EnterTestMode(uCAN, CAN_TEST_BASIC_Msk);

    return u32CurrentBitRate;
}

/**
  * @brief    The function is used to configure a transmit object.
  *
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32MsgNum   Specifies the Message object number, from 0 to 31
  * @param[in]    pCanMsg     Pointer to the message structure where received data is copied.
  *
  * @return   FALSE: No useful interface. \n
  *           TRUE : Config message object success.
  *
  */
int32_t CAN_SetTxMsg(UINT32 uCAN, uint32_t u32MsgNum , STR_CANMSG_T* pCanMsg)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
    uint32_t i=0;

	while((inpw(REG_CAN0_IF1_CREQ+uOffset) & CAN_IF_CREQ_BUSY_Msk) != 0)
	{
		i++;
        if(i > 0x10000000)
            return FALSE;
	}
	
    /* update the contents needed for transmission*/
	outpw((REG_CAN0_IF1_CMASK+uOffset), 0xF3); /*CAN_CMASK_WRRD_Msk | CAN_CMASK_MASK_Msk | CAN_CMASK_ARB_Msk
                                               | CAN_CMASK_CONTROL_Msk | CAN_CMASK_DATAA_Msk  | CAN_CMASK_DATAB_Msk ; */

    if (pCanMsg->IdType == CAN_STD_ID) {
        /* standard ID*/
		outpw((REG_CAN0_IF1_ARB1+uOffset), 0x0);
		outpw((REG_CAN0_IF1_ARB2+uOffset), ((((pCanMsg->Id)&0x7FF)<<2) | CAN_IF_ARB2_DIR_Msk | CAN_IF_ARB2_MSGVAL_Msk));
		
    } else {
        /* extended ID*/
		outpw((REG_CAN0_IF1_ARB1+uOffset), ((pCanMsg->Id)&0xFFFF));
		outpw((REG_CAN0_IF1_ARB2+uOffset), (((pCanMsg->Id)&0x1FFF0000)>>16 | CAN_IF_ARB2_DIR_Msk
                                           | CAN_IF_ARB2_XTD_Msk | CAN_IF_ARB2_MSGVAL_Msk));
    }

