OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/can.c
    if(pCanMsg->FrameType)
		outpw((REG_CAN0_IF1_ARB2+uOffset), (inpw(REG_CAN0_IF1_ARB2+uOffset) | CAN_IF_ARB2_DIR_Msk));
    else
	    outpw((REG_CAN0_IF1_ARB2+uOffset), (inpw(REG_CAN0_IF1_ARB2+uOffset) & ~CAN_IF_ARB2_DIR_Msk));
	
	outpw((REG_CAN0_IF1_DAT_A1+uOffset), (((uint16_t)pCanMsg->Data[1]<<8) | pCanMsg->Data[0]));
	outpw((REG_CAN0_IF1_DAT_A2+uOffset), (((uint16_t)pCanMsg->Data[3]<<8) | pCanMsg->Data[2]));
	outpw((REG_CAN0_IF1_DAT_B1+uOffset), (((uint16_t)pCanMsg->Data[5]<<8) | pCanMsg->Data[4]));
	outpw((REG_CAN0_IF1_DAT_B2+uOffset), (((uint16_t)pCanMsg->Data[7]<<8) | pCanMsg->Data[6]));

	outpw((REG_CAN0_IF1_MCON+uOffset), (CAN_IF_MCON_NEWDAT_Msk | pCanMsg->DLC |CAN_IF_MCON_TXIE_Msk | CAN_IF_MCON_EOB_Msk));
	outpw((REG_CAN0_IF1_CREQ+uOffset), (1 + u32MsgNum));
	
    return TRUE;
}

/**
  * @brief    Set transmit request bit
  *
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32MsgNum    Specifies the Message object number, from 0 to 31.
  *
  * @return   TRUE: Start transmit message.
  */
int32_t CAN_TriggerTxMsg(UINT32 uCAN, uint32_t u32MsgNum)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
    STR_CANMSG_T rMsg;
	
	CAN_ReadMsgObj(uCAN, u32MsgNum,TRUE, &rMsg);
	
    outpw((REG_CAN0_IF1_CMASK+uOffset), (CAN_IF_CMASK_WRRD_Msk |CAN_IF_CMASK_TXRQSTNEWDAT_Msk));
	outpw((REG_CAN0_IF1_CREQ+uOffset), (1 + u32MsgNum));
	
    return TRUE;
}

/**
  * @brief    Enable CAN interrupt
  *
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32Mask    Interrupt Mask. ( \ref CAN_CON_IE_Msk / \ref CAN_CON_SIE_Msk / \ref CAN_CON_EIE_Msk)
  *
  * @return   None
  */
void CAN_EnableInt(UINT32 uCAN, uint32_t u32Mask)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
	CAN_EnterInitMode(uCAN);
	
	outpw((REG_CAN0_CON+uOffset), ((inpw(REG_CAN0_CON+uOffset) & 0xF1) | ((u32Mask & CAN_CON_IE_Msk   )? CAN_CON_IE_Msk :0)
                                | ((u32Mask & CAN_CON_SIE_Msk  )? CAN_CON_SIE_Msk:0)
                                | ((u32Mask & CAN_CON_EIE_Msk  )? CAN_CON_EIE_Msk:0)));
	
	CAN_LeaveInitMode(uCAN);
}

/**
  * @brief    Disable CAN interrupt
  *
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32Mask    Interrupt Mask. ( \ref CAN_CON_IE_Msk / \ref CAN_CON_SIE_Msk / \ref CAN_CON_EIE_Msk)
  *
  * @return   None
  */
void CAN_DisableInt(UINT32 uCAN, uint32_t u32Mask)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;

	CAN_EnterInitMode(uCAN);

	outpw((REG_CAN0_CON+uOffset), (inpw(REG_CAN0_CON+uOffset) & ~(CAN_CON_IE_Msk | ((u32Mask & CAN_CON_SIE_Msk)?CAN_CON_SIE_Msk:0)
                                                              | ((u32Mask & CAN_CON_EIE_Msk)?CAN_CON_EIE_Msk:0))));
	
	CAN_LeaveInitMode(uCAN);
}


/**
  * @brief    The function is used to configure a receive message object
  *
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32MsgNum   Specifies the Message object number, from 0 to 31
  * @param[in]    u32IDType   Specifies the identifier type of the frames that will be transmitted. ( \ref CAN_STD_ID / \ref CAN_EXT_ID)
  * @param[in]    u32ID       Specifies the identifier used for acceptance filtering.
  *
  * @return   FALSE: No useful interface \n
  *           TRUE : Configure a receive message object success.
  *
  */
int32_t CAN_SetRxMsg(UINT32 uCAN, uint32_t u32MsgNum , uint32_t u32IDType, uint32_t u32ID)
{
    uint32_t u32TimeOutCount = 0;

	while(CAN_SetRxMsgObj(uCAN, u32MsgNum, u32IDType, u32ID, TRUE) == FALSE) {
        u32TimeOutCount++;

        if(u32TimeOutCount >= 0x10000000) return FALSE;
    }

    return TRUE;
}

/**
  * @brief    The function is used to configure several receive message objects
  *
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32MsgNum   The starting MSG RAM number. (0 ~ 31)
  * @param[in]    u32MsgCount the number of MSG RAM of the FIFO.
  * @param[in]    u32IDType   Specifies the identifier type of the frames that will be transmitted. ( \ref CAN_STD_ID / \ref CAN_EXT_ID)
  * @param[in]    u32ID       Specifies the identifier used for acceptance filtering.
  *
  * @return   FALSE: No useful interface \n
  *           TRUE : Configure receive message objects success.
  *
  */
int32_t CAN_SetMultiRxMsg(UINT32 uCAN, uint32_t u32MsgNum , uint32_t u32MsgCount, uint32_t u32IDType, uint32_t u32ID)
{
    uint32_t i = 0;
    uint32_t u32TimeOutCount;
    uint32_t u32EOB_Flag = 0;

    for(i= 1; i < u32MsgCount; i++) {
        u32TimeOutCount = 0;

        u32MsgNum += (i - 1);

        if(i == u32MsgCount) u32EOB_Flag = 1;

		while(CAN_SetRxMsgObj(uCAN, u32MsgNum, u32IDType, u32ID, u32EOB_Flag) == FALSE) {
            u32TimeOutCount++;

            if(u32TimeOutCount >= 0x10000000) return FALSE;
        }
    }

    return TRUE;
}


/**
  * @brief    Send CAN message.
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32MsgNum   Specifies the Message object number, from 0 to 31
  * @param[in]    pCanMsg     Pointer to the message structure where received data is copied.
  *
  * @return   FALSE: When operation in basic mode: Transmit message time out, or when operation in normal mode: No useful interface. \n
  *           TRUE : Transmit Message success.
  */
int32_t CAN_Transmit(UINT32 uCAN, uint32_t u32MsgNum , STR_CANMSG_T* pCanMsg)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
	if((inpw(REG_CAN0_CON+uOffset) & CAN_CON_TEST_Msk) && (inpw(REG_CAN0_TEST+uOffset) & CAN_TEST_BASIC_Msk)) {
		return (CAN_BasicSendMsg(uCAN, pCanMsg));
    } else {
		if(CAN_SetTxMsg(uCAN, u32MsgNum, pCanMsg) == FALSE)
            return FALSE;
		CAN_TriggerTxMsg(uCAN, u32MsgNum);
    }

    return TRUE;
}


/**
  * @brief    Gets the message, if received.
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32MsgNum   Specifies the Message object number, from 0 to 31
  * @param[out]    pCanMsg     Pointer to the message structure where received data is copied.
  *
  * @return   FALSE: No any message received. \n
  *           TRUE : Receive Message success.
  */
int32_t CAN_Receive(UINT32 uCAN, uint32_t u32MsgNum , STR_CANMSG_T* pCanMsg)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;
	
	if((inpw(REG_CAN0_CON+uOffset) & CAN_CON_TEST_Msk) && (inpw(REG_CAN0_TEST+uOffset) & CAN_TEST_BASIC_Msk)) {
		return (CAN_BasicReceiveMsg(uCAN, pCanMsg));
    } else {
		return CAN_ReadMsgObj(uCAN, u32MsgNum, TRUE, pCanMsg);
    }
}

/**
  * @brief    Clear interrupt pending bit.
  * @param[in]    uCAN    CAN channel.
  * @param[in]    u32MsgNum   Specifies the Message object number, from 0 to 31
  *
  * @return   None
  *
  */
void CAN_CLR_INT_PENDING_BIT(UINT32 uCAN, uint8_t u32MsgNum)
{
	UINT32 uOffset = uCAN * CAN_OFFSET;

    uint32_t u32MsgIfNum = 0;
    uint32_t u32IFBusyCount = 0;

    while(u32IFBusyCount < 0x10000000) {
		if((inpw(REG_CAN0_IF1_CREQ+uOffset) & CAN_IF_CREQ_BUSY_Msk) == 0) {
            u32MsgIfNum = 0;
            break;
        }else if((inpw(REG_CAN0_IF2_CREQ+uOffset)  & CAN_IF_CREQ_BUSY_Msk) == 0) {
            u32MsgIfNum = 1;
            break;
        }

        u32IFBusyCount++;
    }

	if(u32MsgIfNum == 0)
	{
		outpw((REG_CAN0_IF1_CMASK+uOffset), (CAN_IF_CMASK_CLRINTPND_Msk | CAN_IF_CMASK_TXRQSTNEWDAT_Msk));
		outpw((REG_CAN0_IF1_CREQ+uOffset), (1 + u32MsgNum));
	}
	else if(u32MsgIfNum == 1)
	{	
		outpw((REG_CAN0_IF2_CMASK+uOffset), (CAN_IF_CMASK_CLRINTPND_Msk | CAN_IF_CMASK_TXRQSTNEWDAT_Msk));
		outpw((REG_CAN0_IF2_CREQ+uOffset), (1 + u32MsgNum));
	}
}


/*@}*/ /* end of group NUC970_CAN_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_CAN_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */


/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/


